vcxagency-artillery/test/20-messaging/artillery.yaml
config:
  target: "http://localhost:8080"
  phases:
  - duration: 60  # onboarding phase
    arrivalRate: 2
  - duration: 600 # messagine phase
    arrivalRate: 100
    maxVusers: 100
  processor: "./artillery.proc.js"
scenarios:
- name: "Faber send aries-msg To Alice (f2a)"
  #afterScenario: "reportOnboardingResult"
  flow:
  - function: "f2a_init"
  - loop:
    - post:
        url: "/agency/msg/"
        headers:
          Content-Type: "application/ssi-agent-wire"
        body: "{{ body }}"
        beforeRequest: "f2a_setReqBody"
        #afterResponse: "f2a_handleRes"
    count: 10
  - function: "f2a_summary"